# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

cask 'google-chrome'
cask 'arc'

# Developer specfic applications
cask 'visual-studio-code'
cask 'docker'
brew 'node'
brew 'npm'
brew 'tree'
brew 'asdf'
brew 'fig'
brew 'powerlevel10k'

# Personal stuff
brew 'displaylink'
brew 'mas'
cask 'raycast'
cask '1password'
cask 'slack'
cask 'hyper'
cask 'logitech-options'
cask 'notion'
cask 'rectangle'

# Fonts
cask 'font-font-monaspace'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'

# Mac App Store

