# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

cask 'google-chrome'
cask 'zoom'

# Developer specfic applications
cask 'visual-studio-code'
cask 'docker'
brew 'node'
brew 'npm'
brew 'tree'
brew 'starship'
brew 'asdf'
brew 'fig'

# Personal stuff
brew 'displaylink'
brew 'mas'
cask '1password'
cask 'slack'
cask 'hyper'
cask 'warp'
cask 'logitech-options'
cask 'notion'
cask 'alfred'
cask 'rectangle'

# Adobe
cask 'adobe-creative-cloud'

# Fonts
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-victor-mono'
cask 'font-victor-mono-nerd-font'

# Mac App Store
mas "Things", id: 904280696
