# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'

cask 'google-chrome'
cask 'zoomus'

# Developer specfic applications
cask 'visual-studio-code'
cask 'webstorm'
cask 'docker'
brew 'node'
brew 'npm'
brew 'tree'
brew 'httpie'

# Personal stuff
brew 'mas'
cask '1password'
cask 'slack'
cask 'hyper'
cask 'logitech-options'
cask 'notion'
cask 'alfred'

# Fonts
cask 'font-fira-code'
cask 'font-hasklig'
cask 'font-victor-mono'
cask 'font-lato'
